# ElasticModulusStrongAxis Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionAnalysisParams..::..ElasticModulusStrongAxis Property
StructuralSectionAnalysisParams Class See Also
---
Elastic section modulus about main strong axis for calculation of bending stresses.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double ElasticModulusStrongAxis { get; set; }
```

Visual Basic
---
```text
Public Property ElasticModulusStrongAxis As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ElasticModulusStrongAxis {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace